import cv2
import numpy as np

import os
from collections import defaultdict

from colorthief import ColorThief
import matplotlib.pyplot as plt
from scipy.spatial import distance
import colorsys

color_name = ['흰색', '라이트그레이', '회색', '다크 그레이', '검정색',
              '딥레드', '빨간색', '라즈베리', '네온 핑크', '분홍색',
              '라이트 핑크', '페일 핑크', '피치', '코랄', '라이트 오렌지',
              '네온 오렌지', '오렌지 핑크', '주황색', '아이보리', '라이트 옐로우',
              '노란색', '머스타드', '네온 그린', '라이트 그린', '민트',
              '녹색', '올리브 그린', '카키', '다크 그린', '스카이 블루',
              '네온 블루', '파란색', '네이비', '자주', '라벤더',
              '보라색', '버건디', '갈색', '로즈골드', '레드 브라운',
              '카키 베이지', '카멜', '샌드', '베이지색',
              '데님', '연청', '중청', '진청', '흑청']

color_chip_hsv = [[160, 0, 240], [40, 6, 203], [40, 1, 146], [145, 11, 82], [160, 0, 0],
                [234, 152, 90], [237, 232, 111], [231, 157, 131], [215, 193, 116], [215, 224, 124],
                [232, 240, 197], [6, 115, 177], [11, 220, 184], [4, 193, 153], [20, 240, 120],
                [14, 238, 120], [237, 178, 142], [7, 224, 129], [43, 240, 232], [32, 219, 176],
                [37, 231, 138], [28, 209, 130], [45, 206, 122], [52, 238, 93], [113, 122, 121],
                [74, 190, 90], [46, 92, 91], [39, 53, 70], [84, 93, 45], [131, 179, 152],
                [139, 236, 113], [161, 234, 133], [147, 240, 46], [216, 240, 59], [182, 102, 153],
                [188, 207, 55], [234, 133, 72], [22, 121, 57], [7, 119, 115], [16, 240, 89],
                [29, 240, 76], [25, 163, 123], [24, 78, 165], [26, 166, 170], [140, 44, 106],
                [142, 77, 122], [142, 85, 63], [148, 48, 38], [100, 7, 32]]

color_chip_rgb = [[255, 255, 255], [217, 217, 215], [156, 156, 155], [83, 86, 91], [0, 0, 0],
                [156, 35, 54], [232, 4, 22], [215, 64, 97], [223, 24, 149], [247, 17, 158],
                [255, 163, 182], [220, 166, 156], [250, 171, 141], [237, 104, 89], [254, 124, 0],
                [253, 92, 1], [228, 74, 86], [247, 68, 27], [254, 255, 239], [249, 225, 125],
                [251, 234, 43], [240, 179, 37], [212, 237, 22], [139, 197, 1], [64, 193, 171],
                [42, 172, 20], [122, 134, 60], [91, 90, 58], [29, 66, 33], [91, 193, 231],
                [2, 128, 238], [36, 30, 252], [0, 31, 98], [125, 0, 76], [167, 123, 202],
                [78, 8, 108], [118, 34, 47], [108, 42, 22], [183, 82, 62], [190, 77, 0],
                [161, 116, 0], [215, 154, 47], [201, 180, 149], [232, 195, 129],
                [61, 63, 107], [97, 134, 176], [38, 58, 84], [35, 40, 51], [33, 35, 34]]


def image_preprocess(target_item):


    image = cv2.imread(target_item, cv2.IMREAD_UNCHANGED)
    ct = ColorThief(target_item)

    #이미지에서 가장 많은 비율을 차지하는 색깔 추출
    dominant_color = ct.get_color(quality=1)

    # palette = ct.get_palette(color_count=5)
    print(dominant_color)
    # plt.imshow([[dominant_color]])
    # for i in range(5):
    #     plt.imshow([[palette[i]]])
    idx = 0
    min_idx = 0
    min_dis = 100000
    for color in color_chip_rgb:
        dis = distance.euclidean(color, dominant_color)
        if dis < min_dis:
            min_dis = dis
            min_idx = idx
        idx += 1

    return color_name[min_idx]
    # plt.show()




